app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Cesar is awesome"], ["body", "To be or not to be that is the question"], ["created_at", "2020-05-29 03:13:28.576939"], ["updated_at", "2020-05-29 03:13:28.576939"]]

    def set_blog
      @blog = Blog.friendly.find(params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]