app/controllers/myportfolios_controller.rb

    def index
        @portfolio_items = Myportfolio.all
---
SELECT "myportfolios".* FROM "myportfolios"