app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
    def index
        @portfolio_items = Project.all

INSERT INTO "projects" ("title", "subtitle", "body", "main_image", "thumb_image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @portfolio_item = Project.new(params.require(:project).permit(:title, :subtitle, :body))

    respond_to do |format|
      if @portfolio_item.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @portfolio_item = Project.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "projects" SET "subtitle" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["subtitle", "Fuck You"], ["updated_at", "2020-05-30 06:19:45.431698"], ["id", 3]]
---
  def update
    respond_to do |format|
      @portfolio_item = Project.find(params[:id])
      if @portfolio_item.update(params.require(:project).permit(:title, :subtitle, :body))

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @portfolio_item = Project.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 4]]
---
  def destroy
    @portfolio_item = Project.find(params[:id])
    @portfolio_item.destroy